const sample = `
# 簡歷

## 個人資料

- 姓名：王小明
- 性別：男
- 出生年月：1990年1月
- 手機：0912-345-678
- 電子郵件：xiaoming.wang@email.com

## 技能

- 熟悉 JavaScript、Angular 和 Node.js
- 熟悉 Python 和 Django
- 具備良好的團隊合作和溝通能力

## 教育背景

### 大學
-> 2010年9月-2014年7月

- 學校：國立台灣大學
- 科系：資訊工程學系
- 學位：學士學位


### 研究所
-> 2014年9月-2016年7月

- 學校：國立清華大學
- 科系：資訊工程研究所
- 學位：碩士學位


## 工作經驗

### ABC 公司 
-> 2016年8月-至今

#### 職稱：軟體工程師

- 負責開發和維護公司的網路應用程式
- 使用 Angular 和 Node.js 技術堆疊
- 參與團隊的敏捷式開發流程

### XYZ 公司 
-> 2014年8月-2016年7月)

#### 職稱：實習生

- 協助開發和維護公司的應用程式
- 學習並掌握 Python 和 Django 等技術


`